# Pandas

Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures.

Using Pandas, we can accomplish five typical steps in the processing and analysis of data, regardless of the origin of data â€” load, prepare, manipulate, model, and analyze.

Pandas deals with the following three data structures

1) Series

2) DataFrame

3) Panel

In [ ]:
! pip install pandas

In [1]:
import pandas as pd
import numpy as np

# Pandas Series Data Structure

In [ ]:
# pd.Series(data,index)
# index-> Unique, Hashable, same length as data. By default np.arange(n)

s = pd.Series([1, 2, 3, 4])

print(s)

# Data accessing using Index

In [ ]:
print(s[2])

In [ ]:
print(s[1:3])

In [ ]:
s = pd.Series(['x', 'y', 'z', 'abc'])

print(s)

In [ ]:
s = pd.Series(['kanav', 'bansal'])

print(s)

# Creating Series from Numpy ndarray

In [ ]:
data = np.array([10, 20, 30, 40, 50])

s = pd.Series(data)

print(s)

In [ ]:
data = np.array([[1, 2, 3], [4, 5, 6]])

s = pd.Series(data)

print(s)

# Pandas DataFrame

## Creating DataFrame using Dictionary

In [ ]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'], 'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

In [ ]:
# Creating indexed dataframe

data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'], 
        'Age':[28,34,29,42],
       'Gender':['Male', 'Female', 'Female', 'Male']}
df = pd.DataFrame(data, index=['I-1', 'I-2', 'I-3', 'I-4'])
print(df)

In [ ]:
df = pd.DataFrame({
    'col-1': ['Item-1', 'Item-2', 'Item-3', 'Item-4'],
    'col-2': ['Gold', 'Bronze', 'Gold', 'Silver'],
    'col-3': [1, 2, np.nan, 4]
    })

print(df)

In [ ]:
df.info()

# Creating DataFrame using Tuple

In [ ]:
data = [('1/1/2019', 13, 6, 'Rain'),
       ('2/1/2019', 11, 7, 'Fog'),
       ('3/1/2019', 12, 8, 'Sunny'),
       ('4/1/2019', 8, 5, 'Snow'),
       ('5/1/2019', 9, 6, 'Rain')]
df = pd.DataFrame(data,
                  columns=['Day', 'Temperature', 'WindSpeed', 'Event'])

df

# DataFrame Basic Functionality

In [3]:
# Create Dictionary of Series
dict = {'Name':pd.Series(['Tom', 'Jack', 'Steve', 'Ricky', 'Vin', 'James', 'Vin']),
       'Age':pd.Series([25,26,25,35,23,33,31]),
       'Rating':pd.Series([4.23,4.1,3.4,5,2.9,4.7,3.1])}

df = pd.DataFrame(dict)
df

    Name  Age  Rating
0    Tom   25    4.23
1   Jack   26    4.10
2  Steve   25    3.40
3  Ricky   35    5.00
4    Vin   23    2.90
5  James   33    4.70
6    Vin   31    3.10

In [ ]:
# Prints columns name in the table

df.columns

In [ ]:
# Transpose-> returns transpose of DataFrame
df.T

In [ ]:
df

In [ ]:
# dtypes-> return datatype of each column

df.dtypes

In [ ]:
# shape-> returns tuple representing dimensionallity

df.shape

In [ ]:
# Axes-> returns list of row axis labels and column axis labels

df.axes

In [ ]:
# Data types of each column

df.info()

In [ ]:
# values-> returns actual data as ndarray

df.values

In [ ]:
# head-> by default head returns first 5 rows

df.head()

In [ ]:
df.head(2)

In [ ]:
# tail-> by default tail returns last 5 rows

df.tail()

In [ ]:
df.tail(2)

# Statistics

In [4]:
df

    Name  Age  Rating
0    Tom   25    4.23
1   Jack   26    4.10
2  Steve   25    3.40
3  Ricky   35    5.00
4    Vin   23    2.90
5  James   33    4.70
6    Vin   31    3.10

In [5]:
# sum()-> returns the sum of values for requested axis. by default axis = 0

df.sum()

Name      TomJackSteveRickyVinJamesVin
Age                                198
Rating                           27.43
dtype: object

In [6]:
# axis = 1 -> row wise sum

print(df.sum(1))

0    29.23
1    30.10
2    28.40
3    40.00
4    25.90
5    37.70
6    34.10
dtype: float64

C:\Users\User\AppData\Local\Temp/ipykernel_11128/3449016840.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.sum(1))

In [7]:
# mean()

print(df.mean())

Age       28.285714
Rating     3.918571
dtype: float64

C:\Users\User\AppData\Local\Temp/ipykernel_11128/2283598801.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean())

In [8]:
# std()

print(df.std())

Age       4.644505
Rating    0.804828
dtype: float64

C:\Users\User\AppData\Local\Temp/ipykernel_11128/1674017252.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.std())

In [9]:
# describe() -> summarizing the data

print(df.describe())

             Age    Rating
count   7.000000  7.000000
mean   28.285714  3.918571
std     4.644505  0.804828
min    23.000000  2.900000
25%    25.000000  3.250000
50%    26.000000  4.100000
75%    32.000000  4.465000
max    35.000000  5.000000

# Working with .csv

### Iris Dataset

In [10]:
df = pd.read_csv('data/Iris.csv')

In [11]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [12]:
df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [13]:
print(df.shape)

(150, 6)

In [14]:
print(df.columns)

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [15]:
print(df.mean())

Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64

C:\Users\User\AppData\Local\Temp/ipykernel_11128/2807316344.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean())

In [16]:
print(df.std())

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
dtype: float64

C:\Users\User\AppData\Local\Temp/ipykernel_11128/2597523637.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.std())

In [17]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [18]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

### Weather Dataset

In [19]:
df = pd.read_csv('data/nyc_weather.csv')

In [21]:
df.head(10)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [22]:
# What is the maximum temperature?

df['Temperature'].max()

50

In [23]:
# Select the row with maximum Temperature

df[df.Temperature == df.Temperature.max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [24]:
# Which day it rains?

df['EST'][df['Events'] == 'Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [25]:
# Select the day with maximum Temperature

df.EST[df.Temperature == df.Temperature.max()]

9    1/10/2016
Name: EST, dtype: object

In [26]:
# Average wind speed

df['WindSpeedMPH'].mean()

6.892857142857143

# Pandas DataFrame (Advanced)

In [27]:
import numpy as np
import pandas as pd

In [28]:
df = pd.read_csv('data/Iris.csv')

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [29]:
df.describe(include='all')

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
count,150.000000,150.000000,150.000000,150.000000,150.000000,150
unique,NaN,NaN,NaN,NaN,NaN,3
top,NaN,NaN,NaN,NaN,NaN,Iris-setosa
freq,NaN,NaN,NaN,NaN,NaN,50
mean,75.500000,5.843333,3.054000,3.758667,1.198667,NaN
std,43.445368,0.828066,0.433594,1.764420,0.763161,NaN
min,1.000000,4.300000,2.000000,1.000000,0.100000,NaN
25%,38.250000,5.100000,2.800000,1.600000,0.300000,NaN
50%,75.500000,5.800000,3.000000,4.350000,1.300000,NaN
75%,112.750000,6.400000,3.300000,5.100000,1.800000,NaN
max,150.000000,7.900000,4.400000,6.900000,2.500000,NaN

In [30]:
df.Species.value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

In [31]:
df['Species'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

In [32]:
# apply(function) -> applies the function on all columns
df.apply(np.max)

Id                          150
SepalLengthCm               7.9
SepalWidthCm                4.4
PetalLengthCm               6.9
PetalWidthCm                2.5
Species          Iris-virginica
dtype: object

In [33]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [34]:
# Modifying the Index

df.set_index('Id')

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
Id
1              5.1           3.5            1.4           0.2     Iris-setosa
2              4.9           3.0            1.4           0.2     Iris-setosa
3              4.7           3.2            1.3           0.2     Iris-setosa
4              4.6           3.1            1.5           0.2     Iris-setosa
5              5.0           3.6            1.4           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
146            6.7           3.0            5.2           2.3  Iris-virginica
147            6.3           2.5            5.0           1.9  Iris-virginica
148            6.5           3.0            5.2           2.0  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9           3.0            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [35]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [36]:
# Modifying the Index

df.set_index('Id', inplace = True)

df.head()

    SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
Id
1             5.1           3.5            1.4           0.2  Iris-setosa
2             4.9           3.0            1.4           0.2  Iris-setosa
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa
5             5.0           3.6            1.4           0.2  Iris-setosa

In [38]:
# Sort by Values

df.sort_values(by = 'SepalLengthCm').head(150)

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
Id
14             4.3           3.0            1.1           0.1     Iris-setosa
43             4.4           3.2            1.3           0.2     Iris-setosa
39             4.4           3.0            1.3           0.2     Iris-setosa
9              4.4           2.9            1.4           0.2     Iris-setosa
42             4.5           2.3            1.3           0.3     Iris-setosa
..             ...           ...            ...           ...             ...
123            7.7           2.8            6.7           2.0  Iris-virginica
119            7.7           2.6            6.9           2.3  Iris-virginica
118            7.7           3.8            6.7           2.2  Iris-virginica
136            7.7           3.0            6.1           2.3  Iris-virginica
132            7.9           3.8            6.4           2.0  Iris-virginica

[150 rows x 5 columns]

In [39]:
df['Species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

# Indexing and Slicing

In [40]:
df = pd.read_csv('data/Iris.csv')

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [41]:
# Slicing rows

df[1:4]

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa

In [42]:
new_df = df[['Species']]

print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [43]:
new_df.head()

       Species
0  Iris-setosa
1  Iris-setosa
2  Iris-setosa
3  Iris-setosa
4  Iris-setosa

In [44]:
# Selecting a column

new_df = df['SepalLengthCm']
# new_df = df.SepalLengthCm

print(type(new_df))

new_df.head()

<class 'pandas.core.series.Series'>

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: SepalLengthCm, dtype: float64

In [45]:
# Selecting Multiple columns

new_df = df[['SepalLengthCm', 'PetalLengthCm']]

print(type(new_df))

new_df.head()

<class 'pandas.core.frame.DataFrame'>

   SepalLengthCm  PetalLengthCm
0            5.1            1.4
1            4.9            1.4
2            4.7            1.3
3            4.6            1.5
4            5.0            1.4

In [46]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [47]:
df['Id']

0        1
1        2
2        3
3        4
4        5
      ...
145    146
146    147
147    148
148    149
149    150
Name: Id, Length: 150, dtype: int64

## iloc() vs loc()

- iloc() -> Position Based Indexing (using int indices)
- loc() -> Label Based Indexing

### Position Based Indexing

In [48]:
df = pd.read_csv('data/Iris.csv')

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [49]:
df.set_index('Id', inplace = True)

df.head()

    SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
Id
1             5.1           3.5            1.4           0.2  Iris-setosa
2             4.9           3.0            1.4           0.2  Iris-setosa
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa
5             5.0           3.6            1.4           0.2  Iris-setosa

In [50]:
# SYNTAX -> df.iloc[default_row_index, default_col_index]

df.iloc[2]

SepalLengthCm            4.7
SepalWidthCm             3.2
PetalLengthCm            1.3
PetalWidthCm             0.2
Species          Iris-setosa
Name: 3, dtype: object

In [51]:
df.iloc[1, 2]

1.4

In [52]:
df.iloc[3, :]

SepalLengthCm            4.6
SepalWidthCm             3.1
PetalLengthCm            1.5
PetalWidthCm             0.2
Species          Iris-setosa
Name: 4, dtype: object

In [53]:
# Selecting multiple rows

df.iloc[[2, 3, 6]]

    SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
Id
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa
7             4.6           3.4            1.4           0.3  Iris-setosa

In [54]:
df.iloc[[2, 3, 6], [1, 2, 3]]

    SepalWidthCm  PetalLengthCm  PetalWidthCm
Id
3            3.2            1.3           0.2
4            3.1            1.5           0.2
7            3.4            1.4           0.3

### Label Based Indexing

In [3]:
df = pd.read_csv('data/Iris.csv')

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [56]:
df.set_index('Id', inplace = True)

df.head()

    SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
Id
1             5.1           3.5            1.4           0.2  Iris-setosa
2             4.9           3.0            1.4           0.2  Iris-setosa
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa
5             5.0           3.6            1.4           0.2  Iris-setosa

In [57]:
df.iloc[2]

SepalLengthCm            4.7
SepalWidthCm             3.2
PetalLengthCm            1.3
PetalWidthCm             0.2
Species          Iris-setosa
Name: 3, dtype: object

In [58]:
df.loc[2]

SepalLengthCm            4.9
SepalWidthCm             3.0
PetalLengthCm            1.4
PetalWidthCm             0.2
Species          Iris-setosa
Name: 2, dtype: object

In [59]:
df.loc[2, 'PetalLengthCm']

1.4

In [60]:
# Selecting multiple rows

df.loc[[3, 4, 7]]

    SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
Id
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa
7             4.6           3.4            1.4           0.3  Iris-setosa

In [61]:
df.loc[[3, 4, 7], 'SepalWidthCm':'PetalLengthCm']

    SepalWidthCm  PetalLengthCm
Id
3            3.2            1.3
4            3.1            1.5
7            3.4            1.4

# Selecting Rows based on a Condition

In [8]:
df.loc[df.SepalLengthCm > 7.5, :]

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
105,106,7.6,3.0,6.6,2.1,Iris-virginica
117,118,7.7,3.8,6.7,2.2,Iris-virginica
118,119,7.7,2.6,6.9,2.3,Iris-virginica
122,123,7.7,2.8,6.7,2.0,Iris-virginica
131,132,7.9,3.8,6.4,2.0,Iris-virginica
135,136,7.7,3.0,6.1,2.3,Iris-virginica

In [11]:
df.loc[(df.SepalLengthCm > 7.5) & (df.PetalLengthCm > 4.5), :]

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
105,106,7.6,3.0,6.6,2.1,Iris-virginica
117,118,7.7,3.8,6.7,2.2,Iris-virginica
118,119,7.7,2.6,6.9,2.3,Iris-virginica
122,123,7.7,2.8,6.7,2.0,Iris-virginica
131,132,7.9,3.8,6.4,2.0,Iris-virginica
135,136,7.7,3.0,6.1,2.3,Iris-virginica

In [34]:
df.loc[(df.SepalLengthCm > 7.5) & (df.PetalLengthCm > 6.7), ['Species']]

AttributeError: 'DataFrame' object has no attribute 'SepalLengthCm'

In [33]:
df.loc[df.SepalLengthCm == 7.7, :]

AttributeError: 'DataFrame' object has no attribute 'SepalLengthCm'

#  Merging and Groupby

In [19]:
cust_df = pd.read_csv('data/customer_data.csv')

prod_df = pd.read_csv('data/product_data.csv')

pur_df = pd.read_csv('data/purchase_data.csv')

In [20]:
pur_df.head()

      cust_id prod_id
0  cust_12345   p_001
1  cust_12346   p_003
2  cust_12347   p_002
3  cust_12348   p_004
4  cust_12349   p_001

In [21]:
cust_df.head()

      cust_id  cust_name
0  cust_12345    Sally
1  cust_12346    Jenna
2  cust_12347   Eliana
3  cust_12348  Cristen
4  cust_12349    Steve

In [22]:
prod_df.head()

  prod_id                prod_name
0   p_001         Machine Learning
1   p_002          Data Structures
2   p_003   Full Stack Development
3   p_004  Competitive Programming

In [23]:
df = pd.merge(pur_df, cust_df, how='inner', on='cust_id')
df.head()

      cust_id prod_id  cust_name
0  cust_12345   p_001    Sally
1  cust_12346   p_003    Jenna
2  cust_12347   p_002   Eliana
3  cust_12348   p_004  Cristen
4  cust_12349   p_001    Steve

In [24]:
df = pd.merge(df, prod_df, how='inner', on='prod_id')
df.head(20)

       cust_id prod_id   cust_name               prod_name
0   cust_12345   p_001     Sally          Machine Learning
1   cust_12349   p_001     Steve          Machine Learning
2   cust_12350   p_001     Kelli          Machine Learning
3   cust_12352   p_001    Aretha          Machine Learning
4   cust_12355   p_001     Carla          Machine Learning
5   cust_12357   p_001   Normand          Machine Learning
6   cust_12358   p_001       Nam          Machine Learning
7   cust_12367   p_001    Taunya          Machine Learning
8   cust_12369   p_001      Dung          Machine Learning
9   cust_12346   p_003     Jenna    Full Stack Development
10  cust_12353   p_003     Pansy    Full Stack Development
11  cust_12359   p_003  Latrisha    Full Stack Development
12  cust_12363   p_003     Shela    Full Stack Development
13  cust_12370   p_003     Angla    Full Stack Development
14  cust_12347   p_002    Eliana           Data Structures
15  cust_12350   p_002     Kelli           Data Structures
16  cust_12354   p_002   Jennell           Data Structures
17  cust_12356   p_002     Hiram           Data Structures
18  cust_12357   p_002   Normand           Data Structures
19  cust_12361   p_002   Laureen           Data Structures

In [26]:
df.prod_name.value_counts()

Machine Learning           9
Data Structures            9
Competitive Programming    6
Full Stack Development     5
Name: prod_name, dtype: int64

In [27]:
new_df = df.groupby('prod_name')

new_df

In [28]:
new_df.head()

       cust_id prod_id    cust_name                prod_name
0   cust_12345   p_001      Sally           Machine Learning
1   cust_12349   p_001      Steve           Machine Learning
2   cust_12350   p_001      Kelli           Machine Learning
3   cust_12352   p_001     Aretha           Machine Learning
4   cust_12355   p_001      Carla           Machine Learning
9   cust_12346   p_003      Jenna     Full Stack Development
10  cust_12353   p_003      Pansy     Full Stack Development
11  cust_12359   p_003   Latrisha     Full Stack Development
12  cust_12363   p_003      Shela     Full Stack Development
13  cust_12370   p_003      Angla     Full Stack Development
14  cust_12347   p_002     Eliana            Data Structures
15  cust_12350   p_002      Kelli            Data Structures
16  cust_12354   p_002    Jennell            Data Structures
17  cust_12356   p_002      Hiram            Data Structures
18  cust_12357   p_002    Normand            Data Structures
23  cust_12348   p_004    Cristen    Competitive Programming
24  cust_12351   p_004  Carmelita    Competitive Programming
25  cust_12360   p_004    Jessica    Competitive Programming
26  cust_12362   p_004    Trinity    Competitive Programming
27  cust_12366   p_004      Genna    Competitive Programming

In [29]:
new_df.first()

                            cust_id prod_id  cust_name
prod_name
Competitive Programming  cust_12348   p_004  Cristen
Data Structures          cust_12347   p_002   Eliana
Full Stack Development   cust_12346   p_003    Jenna
Machine Learning         cust_12345   p_001    Sally

In [30]:
new_df.groups.keys()

dict_keys(['Competitive Programming', 'Data Structures', 'Full Stack Development', 'Machine Learning'])

In [31]:
new_df.get_group('Data Structures')

       cust_id prod_id  cust_name        prod_name
14  cust_12347   p_002   Eliana    Data Structures
15  cust_12350   p_002    Kelli    Data Structures
16  cust_12354   p_002  Jennell    Data Structures
17  cust_12356   p_002    Hiram    Data Structures
18  cust_12357   p_002  Normand    Data Structures
19  cust_12361   p_002  Laureen    Data Structures
20  cust_12363   p_002    Shela    Data Structures
21  cust_12364   p_002     Raye    Data Structures
22  cust_12365   p_002   Vickie    Data Structures

In [32]:
new_df.describe()

                        cust_id                         prod_id                \
                          count unique         top freq   count unique    top
prod_name
Competitive Programming       6      6  cust_12348    1       6      1  p_004
Data Structures               9      9  cust_12347    1       9      1  p_002
Full Stack Development        5      5  cust_12346    1       5      1  p_003
Machine Learning              9      9  cust_12345    1       9      1  p_001

                             cust_name
                        freq     count unique        top freq
prod_name
Competitive Programming    6         6      6  Cristen      1
Data Structures            9         9      9   Eliana      1
Full Stack Development     5         5      5    Jenna      1
Machine Learning           9         9      9    Sally      1